{
  "backend/announcements.mo": "Manages announcements with admin‑restricted create/edit functions and retrieval of single or all announcements stored in a Map.",
  "backend/blog.mo": "Implements blog posts, comments, reactions, and tips with creation, editing, deletion, and authorization checks stored in state Maps.",
  "backend/main.mo": "Defines core Phil3 backend actor including user profiles, elections, consensus meetings, tokenomics, join requests, and storage integrations.",
  "backend/notifications.mo": "Handles notification creation, read‑status updates, and fetching user notifications using a Map‑based state.",
  "feature_evidence.json": "Feature evidence report describing a specific login page text update and listing affected frontend files and components.",
  "frontend-file-summaries.txt": "Prewritten summaries of all frontend files including pages, components, hooks, and styling.",
  "frontend/index.html": "Base HTML entry point mounting the React app with main.tsx.",
  "frontend/index.ts": "Contains a conditional determining when to show a leave‑community button.",
  "frontend/src/App.tsx": "Main React app wrapper with authentication flow, profile loading logic, global providers, and an error boundary.",
  "frontend/src/components/CopyAddressButton.tsx": "Button component that copies a provided address to the clipboard using the Clipboard API or a fallback and shows toast notifications.",
  "frontend/src/components/dashboard/AdminTab.tsx": "Admin dashboard tab for managing UCA text, meetings, join requests, member admin actions, and user deletions.",
  "frontend/src/components/dashboard/AnnouncementDialog.tsx": "Dialog for creating or editing announcements using a rich text editor, with validation and localized messages.",
  "frontend/src/components/dashboard/AnnouncementsTab.tsx": "Displays announcements with admin-only creation/editing, sorting, previews, and loading/error states.",
  "frontend/src/components/dashboard/BlogPostDialog.tsx": "Empty file placeholder for a blog post dialog component.",
  "frontend/src/components/dashboard/BlogPostView.tsx": "Empty file placeholder for viewing a blog post.",
  "frontend/src/components/dashboard/BlogTab.tsx": "Empty file placeholder for blog-related dashboard tab.",
  "frontend/src/components/dashboard/ConsensusMeetingCard.tsx": "Renders detailed controls and status for a consensus meeting, including phase transitions, signup, timers, and forms for contributions or rankings.",
  "frontend/src/components/dashboard/ConsensusMeetingsTab.tsx": "Lists active and past consensus meetings, allows signup, and opens detailed meeting views if permitted.",
  "frontend/src/components/dashboard/ContributionForm.tsx": "Lets a user submit contribution text and files for a consensus meeting, showing group members and handling uploads.",
  "frontend/src/components/dashboard/CouncilTab.tsx": "Displays council dashboard data and actions, enabling eligible users to propose, approve, and recalculate council actions with various loading and error states.",
  "frontend/src/components/dashboard/DailyRewardCard.tsx": "Displays daily reward eligibility, user category info, and claim actions with cooldown and error handling logic.",
  "frontend/src/components/dashboard/DailyRewardsConfigCard.tsx": "Provides an admin interface to view and edit daily reward configuration values, with validation and save functionality.",
  "frontend/src/components/dashboard/DocumentationTab.tsx": "Renders an in-app documentation browser with searchable sections, topics, and localized content.",
  "frontend/src/components/dashboard/DonatePHILCard.tsx": "Allows users to donate PHIL tokens to other users or treasuries with validation, confirmation, and error handling.",
  "frontend/src/components/dashboard/EditProfileDialog.tsx": "Modal dialog for editing a user's profile, supporting username, bio, and profile picture upload with preview and validation.",
  "frontend/src/components/dashboard/EditTokenomicsDialog.tsx": "Dialog component allowing admins to update the tokenomics launch date by selecting a date and time and submitting it to the backend.",
  "frontend/src/components/dashboard/ElectionsTab.tsx": "Placeholder file with no implementation.",
  "frontend/src/components/dashboard/MeetingResults.tsx": "Displays consensus meeting results, calculating expected REP and PHIL rewards and showing rankings, user rewards, and summary cards.",
  "frontend/src/components/dashboard/MembersTab.tsx": "Shows member list with search, join request approval, and role-based access checks for admins and active members.",
  "frontend/src/components/dashboard/NextTokenMintCard.tsx": "Placeholder file with no implementation.",
  "frontend/src/components/dashboard/OverviewTab.tsx": "Overview page presenting user profile, membership status, balances, category badges, and dialogs for editing, UCA acceptance, and leaving the community.",
  "frontend/src/components/dashboard/ProposalsTab.tsx": "Manages proposal creation, approval, rejection, and displays proposals with permission checks for active members, admins, and council members.",
  "frontend/src/components/dashboard/RankingForm.tsx": "Interactive form for ranking group members, displaying contributions and submitting ordered rankings to the backend.",
  "frontend/src/components/dashboard/RegisterCandidateDialog.tsx": "Empty file placeholder for a candidate registration dialog.",
  "frontend/src/components/dashboard/TokenomicsInfoSection.tsx": "Displays tokenomics metrics for authorized users, including supply, treasury balances, mint cycle status, and halving data.",
  "frontend/src/components/dashboard/TokenomicsTab.tsx": "Admin-focused tokenomics management tab showing supply metrics, treasury data, minting status, and allowing manual minting and config edits.",
  "frontend/src/components/dashboard/UCADialog.tsx": "Dialog for viewing and accepting the User Contribution Agreement, requiring confirmation before submission.",
  "frontend/src/components/dashboard/WalletTab.tsx": "Empty file placeholder for a wallet-related dashboard tab.",
  "frontend/src/components/dashboard/WeeklyREPCard.tsx": "Card showing 12-week REP history, latest balance, averages, and a detailed weekly breakdown.",
  "frontend/src/components/Footer.tsx": "Footer displaying copyright text with localized strings and a heart icon linking to caffeine.ai.",
  "frontend/src/components/Header.tsx": "Main header with language switcher, theme toggle, notifications, and user profile dropdown including logout and admin options.",
  "frontend/src/components/LanguageSwitcher.tsx": "Dropdown to switch between supported locales, showing flags and labels for available languages.",
  "frontend/src/components/NotificationsDropdown.tsx": "Dropdown listing unread notifications with timestamps, allowing marking single or all notifications as read.",
  "frontend/src/contexts/LanguageContext.tsx": "Provides locale state, translation lookup, and language switching via React context.",
  "frontend/src/hooks/useActor.ts": "Creates and manages a backend actor tied to the user's identity, refreshing dependent queries when identity changes.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides a React context and provider for Internet Identity authentication using Dfinity AuthClient, exposing identity state, login, and logout helpers.",
  "frontend/src/hooks/useQueries.ts": "Defines numerous React Query hooks for interacting with backend actors, covering user profiles, UCA actions, membership, and other domain data.",
  "frontend/src/hooks/useTokenPrices.ts": "Empty placeholder file for future token price fetching logic.",
  "frontend/src/index.css": "Tailwind CSS configuration defining color variables, theming, and base styles for light and dark modes.",
  "frontend/src/lib/i18n.ts": "Implements locale storage and helpers for formatting dates, numbers, and pluralization for English and French.",
  "frontend/src/lib/translations.ts": "Defines the structured translation keys and interfaces used throughout the application for internationalized UI text.",
  "frontend/src/main.tsx": "Initializes React, wraps the app in QueryClientProvider and InternetIdentityProvider, and mounts it to the DOM.",
  "frontend/src/pages/DashboardPage.tsx": "Renders the dashboard with role‑based tab visibility and localized UI, using multiple feature tabs and loading fallbacks.",
  "frontend/src/pages/LoginPage.tsx": "Renders the login landing page with hero text, value propositions, and an Internet Identity login button with loading state.",
  "frontend/src/pages/ProfileSetupPage.tsx": "Provides a profile creation form with image upload, validation, and submission to save the user's profile.",
  "frontend/src/pages/UCAAcceptancePage.tsx": "Empty page placeholder with no implemented content.",
  "frontend/src/types/backend-extensions.ts": "Defines extended backend-related TypeScript interfaces and enums not exported by the generated backend.",
  "frontend/src/utils/urlParams.ts": "Utility functions for reading, storing, and clearing URL and session parameters, including hash‑based routing support.",
  "frontend/tailwind.config.js": "Tailwind CSS configuration extending theme colors, animations, and plugins such as typography and container queries.",
  "project_state.json": "Metadata describing project state, features, requests, and configuration for the Phil3 platform."
}