{
  "backend/announcements.mo": "Motoko module for managing announcements with admin-only create/edit permissions, storing announcement data (title, content, author, timestamps) in a Map, and providing retrieval functions.",
  "backend/blog.mo": "Motoko module implementing a blog system with posts, comments, reactions, and tips, including authorization checks for post editing/deletion by authors or admins.",
  "backend/main.mo": "Main actor canister integrating multiple modules (AccessControl, Blog, Announcements, UserApproval, Notifications, Stripe, Storage) with types for user profiles, consensus meetings, elections, tokenomics, join requests, and treasury management.",
  "backend/notifications.mo": "Motoko module for creating and managing user notifications with read/unread status, recipient-only access control, and filtering functions for retrieving notifications.",
  "feature_evidence.json": "Feature evidence report documenting the addition of a hero visual element to the LoginPage component with high confidence, listing affected files and components.",
  "frontend-file-summaries.txt": "Comprehensive summaries of frontend React components including App, pages (Login, Dashboard, ProfileSetup, UCAAcceptance), hooks (useQueries), and dashboard tabs with bilingual support and authentication flows.",
  "frontend/index.html": "HTML entry point for the Phil3 application with viewport meta tag and root div for React mounting.",
  "frontend/index.ts": "TypeScript snippet calculating whether to show a leave button based on user profile and membership status.",
  "frontend/src/App.tsx": "Main React application component with ErrorBoundary, authentication flow routing (login → profile setup → dashboard), loading states, and theme/language providers.",
  "frontend/src/components/CopyAddressButton.tsx": "A button component that copies a blockchain address to the clipboard using the Clipboard API with a fallback for older browsers, showing toast notifications on success or failure.",
  "frontend/src/components/dashboard/AdminTab.tsx": "Admin dashboard tab with sections for managing UCA (User Contribution Agreement), creating consensus meetings, handling join requests, managing members (promote/delete), and tokenomics configuration.",
  "frontend/src/components/dashboard/AnnouncementDialog.tsx": "A dialog component for creating/editing announcements with rich text editor (ReactQuill), currently disabled but kept to prevent build errors.",
  "frontend/src/components/dashboard/AnnouncementsTab.tsx": "A React component for displaying and managing announcements with admin controls for creating/editing. Currently disabled/hidden with placeholder empty data, but kept to prevent build errors.",
  "frontend/src/components/dashboard/BlogPostDialog.tsx": "Empty file with no content.",
  "frontend/src/components/dashboard/BlogPostView.tsx": "Empty file with no content.",
  "frontend/src/components/dashboard/BlogTab.tsx": "Empty file with no content.",
  "frontend/src/components/dashboard/ConsensusMeetingCard.tsx": "Displays detailed view of a consensus meeting with phase-based UI (signup, contribution, ranking, finalize), countdown timer, participant status, and admin controls for phase advancement.",
  "frontend/src/components/dashboard/ConsensusMeetingsTab.tsx": "Lists all consensus meetings with active/past separation, shows meeting status, phase badges, participant counts, and handles signup/navigation to detailed meeting views.",
  "frontend/src/components/dashboard/ContributionForm.tsx": "Form component for submitting contributions during consensus meeting contribution phase, supporting text input and file uploads with progress tracking, displaying group members and existing contributions.",
  "frontend/src/components/dashboard/CouncilTab.tsx": "Council management dashboard showing council statistics, member list with average REP, pending actions requiring approval, and admin tools for proposing actions and recalculating council membership.",
  "frontend/src/components/dashboard/DailyRewardCard.tsx": "Displays daily reward eligibility and claim functionality with user category badges, cooldown timers, and reward amounts. Handles reward claiming with error handling for insufficient funds, cooldown periods, and displays formatted time remaining.",
  "frontend/src/components/dashboard/DailyRewardsConfigCard.tsx": "Admin configuration card for managing daily reward amounts per user category (non-member, member, active member) and allocation percentage. Provides editable form with validation for percentage values between 0-100.",
  "frontend/src/components/dashboard/DocumentationTab.tsx": "Knowledge base documentation tab with searchable accordion sections covering membership, governance, and other platform topics. Supports bilingual content (English/French) with icons and structured topic organization.",
  "frontend/src/components/dashboard/DonatePHILCard.tsx": "Card component for donating PHIL tokens to either users or treasury targets (rewards, marketing, council). Includes recipient selection, amount input, balance validation, and confirmation dialog before executing donations.",
  "frontend/src/components/dashboard/EditProfileDialog.tsx": "Modal dialog for editing user profile including username, bio, and profile picture upload. Handles image file validation (type and size), preview generation, and upload progress tracking with ExternalBlob integration.",
  "frontend/src/components/dashboard/EditTokenomicsDialog.tsx": "Dialog component for editing tokenomics configuration, specifically the launch date and time for automatic token minting. Handles date/time selection with calendar UI and converts between Date objects and nanosecond timestamps for backend updates.",
  "frontend/src/components/dashboard/ElectionsTab.tsx": "Empty file with no content.",
  "frontend/src/components/dashboard/MeetingResults.tsx": "Displays consensus meeting results including group consensus status, participant rankings, and calculated REP/PHIL token rewards using Fibonacci weighting. Shows expected rewards for the current user and total rewards distributed across all participants.",
  "frontend/src/components/dashboard/MembersTab.tsx": "Tab component displaying all community members with search functionality, profile information, and pending join requests. Restricted to admins and active members, with approval functionality for pending member requests.",
  "frontend/src/components/dashboard/NextTokenMintCard.tsx": "Empty file with no content.",
  "frontend/src/components/dashboard/OverviewTab.tsx": "Main dashboard overview displaying user profile, token balances, membership status, and category badges. Includes functionality for profile editing, UCA acceptance, joining/leaving community, daily rewards, and PHIL token donations.",
  "frontend/src/components/dashboard/ProposalsTab.tsx": "Tab for creating and voting on community proposals with status tracking (pending/approved/rejected). Active members can create proposals, while council members and admins can approve or reject them with vote tracking.",
  "frontend/src/components/dashboard/RankingForm.tsx": "A form component for ranking group members in consensus meetings, allowing users to reorder members via drag controls and submit their rankings to the backend.",
  "frontend/src/components/dashboard/RegisterCandidateDialog.tsx": "Empty file with no content.",
  "frontend/src/components/dashboard/TokenomicsInfoSection.tsx": "Displays tokenomics overview cards (supply, treasury, inflation, minting) for admins and council members, showing metrics like current supply progress, halving schedules, and next mint time.",
  "frontend/src/components/dashboard/TokenomicsTab.tsx": "A detailed tokenomics management tab showing configuration, treasury balances, supply metrics, and mint cycle status with admin controls for editing config and manual minting.",
  "frontend/src/components/dashboard/UCADialog.tsx": "A modal dialog that displays the User Contribution Agreement text, requires users to confirm they've read it via checkbox, and handles acceptance before allowing join requests.",
  "frontend/src/components/dashboard/WalletTab.tsx": "Empty file with no content.",
  "frontend/src/components/dashboard/WeeklyREPCard.tsx": "Displays a card showing the user's 12-week REP (reputation) token history with current balance, average REP, and a scrollable list of weekly entries.",
  "frontend/src/components/Footer.tsx": "A simple footer component displaying copyright information and a link to caffeine.ai with internationalization support.",
  "frontend/src/components/Header.tsx": "Main header component with user authentication state, profile dropdown menu, theme toggle, language switcher, and notifications dropdown. Includes admin badge and logout functionality.",
  "frontend/src/components/LanguageSwitcher.tsx": "A dropdown menu component that allows users to switch between English and French locales with flag icons.",
  "frontend/src/components/NotificationsDropdown.tsx": "A dropdown component displaying unread notifications with badge count, mark-as-read functionality, and relative timestamps using date-fns with locale support.",
  "frontend/src/contexts/LanguageContext.tsx": "React context provider for managing application locale (en/fr), persisting language preference to storage, and providing translated strings throughout the app.",
  "frontend/src/hooks/useActor.ts": "Custom hook that creates and manages the backend actor instance based on Internet Identity authentication state, initializing access control and invalidating dependent queries on identity changes.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides React context and hooks for Internet Identity authentication, managing login state, identity storage, and delegation validation with configurable AuthClient options.",
  "frontend/src/hooks/useQueries.ts": "Defines React Query hooks for all backend API interactions including user profiles, UCA acceptance, membership, elections, consensus meetings, council operations, tokenomics, and notifications.",
  "frontend/src/hooks/useTokenPrices.ts": "Empty file, likely intended for token price fetching functionality.",
  "frontend/src/index.css": "Tailwind CSS configuration with custom CSS variables defining a governance-themed color palette (blues and purples) for both light and dark modes, including sidebar, chart, and semantic color tokens.",
  "frontend/src/lib/i18n.ts": "Internationalization utilities supporting English and French locales with functions for locale storage, date/time formatting, number formatting, and pluralization.",
  "frontend/src/lib/translations.ts": "Defines TypeScript interfaces for translation strings organized by feature (common, header, footer, homepage, login, dashboard, members, elections, etc.) supporting multi-language content.",
  "frontend/src/main.tsx": "Application entry point that sets up React root with QueryClientProvider for data fetching and InternetIdentityProvider for authentication.",
  "frontend/src/pages/DashboardPage.tsx": "Main dashboard page with tabbed interface showing Overview, Members, Consensus, Council, Proposals, Tokenomics, and Admin tabs with role-based visibility controlled by user category and permissions.",
  "frontend/src/pages/LoginPage.tsx": "Landing page component displaying Phil3's mission statement, features, and login functionality using Internet Identity authentication with animated hero image and feature cards.",
  "frontend/src/pages/ProfileSetupPage.tsx": "Profile creation form allowing users to set username, email, bio, and upload a profile picture with validation and progress tracking using ExternalBlob for image handling.",
  "frontend/src/pages/UCAAcceptancePage.tsx": "Empty file with no content.",
  "frontend/src/types/backend-extensions.ts": "TypeScript type definitions extending backend functionality including Announcement, BlogPost, Election, ConsensusMeeting, Tokenomics, and Treasury types not exported from generated backend interface.",
  "frontend/src/utils/urlParams.ts": "Utility functions for extracting, persisting, and managing URL parameters from both query strings and hash-based routing, with sessionStorage integration for parameter persistence.",
  "frontend/tailwind.config.js": "Tailwind CSS configuration defining custom color scheme using OKLCH color space, container settings, border radius variables, custom animations, and plugins for typography and container queries.",
  "project_state.json": "Project metadata tracking architectural notes, known issues, existing features related to LoginPage mission text reordering and hero visual additions, and image requirements for community-focused hero illustration."
}