{
  "backend/announcements.mo": "Motoko module managing announcements with admin-only create/edit permissions, storing announcement data (id, title, content, author, timestamps) in a Map, and providing CRUD operations.",
  "backend/blog.mo": "Motoko module implementing blog functionality with posts, comments, reactions, and tips, including authorization checks for post editing/deletion (author or admin only) and cascading deletion of related content.",
  "backend/main.mo": "Main actor canister integrating multiple modules (AccessControl, Storage, Announcements, Blog, Notifications, Stripe, etc.) and defining core types for user profiles, consensus meetings, elections, tokenomics, and join requests with comprehensive governance and community management logic.",
  "backend/notifications.mo": "Motoko module for managing user notifications with create, mark-as-read, and retrieval functions, ensuring only recipients can mark their own notifications as read.",
  "feature_evidence.json": "Feature evidence report documenting two completed features: updating LoginPage component for bilingual translations and adding French translations to the translations system, both with high confidence.",
  "frontend-file-summaries.txt": "Comprehensive summaries of frontend React components and pages, describing authentication flows, dashboard tabs, profile management, consensus meetings, bilingual support, and UI theming with OKLCH colors.",
  "frontend/index.html": "HTML entry point for the Phil3 application with viewport meta tag and root div for React mounting.",
  "frontend/index.ts": "TypeScript snippet calculating whether to show a leave button based on user profile and membership status.",
  "frontend/src/App.tsx": "Main React application component with error boundary, authentication flow routing (login → profile setup → dashboard), loading states, and theme/language providers wrapping the entire app.",
  "frontend/src/components/CopyAddressButton.tsx": "A button component that copies an address to the clipboard using the Clipboard API with a fallback for older browsers, displaying a toast notification on success or failure.",
  "frontend/src/components/dashboard/AdminTab.tsx": "Admin dashboard tab with sections for managing UCA text, creating consensus meetings, handling join requests, managing members (promote/delete), and tokenomics configuration.",
  "frontend/src/components/dashboard/AnnouncementDialog.tsx": "A dialog component for creating/editing announcements with a rich text editor (ReactQuill), currently disabled but kept to prevent build errors.",
  "frontend/src/components/dashboard/AnnouncementsTab.tsx": "Displays announcements with admin creation/editing capabilities, expandable cards, and date formatting. Currently disabled with empty placeholder data but kept to prevent build errors.",
  "frontend/src/components/dashboard/BlogPostDialog.tsx": "Empty file.",
  "frontend/src/components/dashboard/BlogPostView.tsx": "Empty file.",
  "frontend/src/components/dashboard/BlogTab.tsx": "Empty file.",
  "frontend/src/components/dashboard/ConsensusMeetingCard.tsx": "Displays detailed view of a consensus meeting with phase-specific UI (signup, contribution, ranking, results), countdown timer, and admin controls for phase advancement. Handles participant signup and phase transitions.",
  "frontend/src/components/dashboard/ConsensusMeetingsTab.tsx": "Lists all consensus meetings with active/past separation, shows meeting status badges, and allows users to sign up or view details based on participation status and user category.",
  "frontend/src/components/dashboard/ContributionForm.tsx": "Form for submitting contributions during consensus meetings with text input, file uploads with progress tracking, and displays group members and existing contributions.",
  "frontend/src/components/dashboard/CouncilTab.tsx": "Council member dashboard for proposing and approving actions, viewing council statistics, and admin controls for recalculating council membership based on average REP scores.",
  "frontend/src/components/dashboard/DailyRewardCard.tsx": "Displays daily reward eligibility and claim functionality for users, showing reward amounts based on user category (non-member, member, active member), cooldown timers, and handling reward claims with error handling for insufficient funds and cooldown periods.",
  "frontend/src/components/dashboard/DailyRewardsConfigCard.tsx": "Admin configuration card for managing daily reward settings including reward amounts per user category (non-member, member, active member) and allocation percentage from treasury, with edit and save functionality.",
  "frontend/src/components/dashboard/DocumentationTab.tsx": "Knowledge base documentation component with searchable accordion sections covering membership, governance, and other platform topics in both English and French, using icons and structured content for each topic.",
  "frontend/src/components/dashboard/DonatePHILCard.tsx": "Card component for donating PHIL tokens to either individual users or treasury targets (rewards, marketing, council), with amount validation, recipient selection, and confirmation dialog before executing donations.",
  "frontend/src/components/dashboard/EditProfileDialog.tsx": "Dialog component for editing user profile information including username, bio, and profile picture with image upload, preview, and progress tracking functionality.",
  "frontend/src/components/dashboard/EditTokenomicsDialog.tsx": "Dialog component for editing tokenomics configuration, specifically the launch date and time for automatic token minting. Handles date/time selection with calendar UI and converts between Date objects and nanosecond timestamps for backend updates.",
  "frontend/src/components/dashboard/ElectionsTab.tsx": "Empty file with no content.",
  "frontend/src/components/dashboard/MeetingResults.tsx": "Displays consensus meeting results including group consensus status, participant rankings, and calculated token rewards (REP and PHIL) using Fibonacci weighting schemes. Shows expected rewards for users and provides detailed breakdown of consensus outcomes.",
  "frontend/src/components/dashboard/MembersTab.tsx": "Tab component for viewing all community members with search functionality and pending join request approvals. Restricts access to admins and active members, displays member profiles in a table with avatars, categories, and admin badges.",
  "frontend/src/components/dashboard/NextTokenMintCard.tsx": "Empty file with no content.",
  "frontend/src/components/dashboard/OverviewTab.tsx": "Dashboard overview tab showing user profile, token balances (REP/PHIL), membership status, and category badges. Includes functionality for editing profile, accepting UCA, joining/leaving community, daily rewards, and donations.",
  "frontend/src/components/dashboard/ProposalsTab.tsx": "Tab for creating and voting on community proposals with status tracking (pending/approved/rejected). Active members can create proposals while council members and admins can approve or reject them, with vote tracking per user.",
  "frontend/src/components/dashboard/RankingForm.tsx": "A form component for ranking group members in consensus meetings, allowing users to reorder members via drag controls and submit their rankings. Displays group contributions for reference and handles submission state.",
  "frontend/src/components/dashboard/RegisterCandidateDialog.tsx": "Empty file with no content.",
  "frontend/src/components/dashboard/TokenomicsInfoSection.tsx": "Displays tokenomics overview cards (supply, treasury, inflation, halving, mint cycle) for admins and council members. Shows key metrics with progress bars, badges, and formatted dates using date-fns localization.",
  "frontend/src/components/dashboard/TokenomicsTab.tsx": "Admin-only tab displaying detailed tokenomics configuration, treasury balances, supply progress, and mint cycle status. Includes manual mint trigger and edit dialog for updating tokenomics parameters.",
  "frontend/src/components/dashboard/UCADialog.tsx": "Modal dialog for displaying and accepting the User Contribution Agreement (UCA). Requires users to read and confirm acceptance via checkbox before proceeding with join requests.",
  "frontend/src/components/dashboard/WalletTab.tsx": "Empty file with no content.",
  "frontend/src/components/dashboard/WeeklyREPCard.tsx": "Card component displaying user's 12-week REP (reputation) token history with current balance, average, and historical entries. Shows loading and empty states appropriately.",
  "frontend/src/components/Footer.tsx": "A simple footer component displaying copyright information and a link to caffeine.ai with a heart icon.",
  "frontend/src/components/Header.tsx": "Main header component with user authentication state, profile dropdown menu, theme toggle, language switcher, and notifications dropdown.",
  "frontend/src/components/LanguageSwitcher.tsx": "A dropdown menu component that allows users to switch between English and French locales using flag emojis and language labels.",
  "frontend/src/components/NotificationsDropdown.tsx": "A dropdown component displaying unread notifications with a badge counter, allowing users to mark individual or all notifications as read with relative timestamps.",
  "frontend/src/contexts/LanguageContext.tsx": "React context provider for managing application locale (en/fr) with localStorage persistence. Provides locale state, setter, and translated strings throughout the app.",
  "frontend/src/hooks/useActor.ts": "Custom hook that creates and manages the backend actor instance based on Internet Identity authentication state. Invalidates dependent queries when actor changes and initializes access control for authenticated users.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides React context and hooks for Internet Identity authentication, managing login state, identity persistence, and delegation validation with configurable AuthClient options.",
  "frontend/src/hooks/useQueries.ts": "Defines React Query hooks for all backend API calls including user profiles, UCA acceptance, membership, elections, consensus meetings, council operations, tokenomics, proposals, and notifications.",
  "frontend/src/hooks/useTokenPrices.ts": "Empty file, likely intended for token price fetching functionality.",
  "frontend/src/index.css": "Tailwind CSS configuration with custom CSS variables defining a governance-themed color palette (blues and purples) for both light and dark modes, including sidebar, chart, and semantic colors.",
  "frontend/src/lib/i18n.ts": "Internationalization utilities supporting English and French locales with functions for locale storage, date/time formatting, number formatting, and pluralization.",
  "frontend/src/lib/translations.ts": "Translation string definitions organized by feature (common, header, footer, homepage, login, dashboard, etc.) with TypeScript interface for type-safe i18n.",
  "frontend/src/main.tsx": "Application entry point that sets up React Query client and Internet Identity provider, then renders the root App component.",
  "frontend/src/pages/DashboardPage.tsx": "Main dashboard page with tabbed interface showing Overview, Members, Admin, Consensus, Council, Proposals, and Tokenomics tabs with role-based visibility controlled by user category and admin status.",
  "frontend/src/pages/LoginPage.tsx": "Landing page component displaying hero section, mission statement, value propositions, and login button using Internet Identity authentication. Uses translation context for bilingual support and includes feature cards showcasing platform benefits.",
  "frontend/src/pages/ProfileSetupPage.tsx": "Profile creation form allowing users to set username, email, bio, and upload profile picture with validation and progress tracking. Uses ExternalBlob for image handling and saves profile via useSaveCallerUserProfile mutation.",
  "frontend/src/pages/UCAAcceptancePage.tsx": "Empty file placeholder for User Contribution Agreement acceptance page.",
  "frontend/src/types/backend-extensions.ts": "TypeScript type definitions extending backend types including Announcement, BlogPost, Election, ConsensusMeetingView, GroupView, Contribution, Ranking, and TokenomicsConfig. Defines ConsensusPhase enum and re-exports backend types.",
  "frontend/src/utils/urlParams.ts": "Utility functions for extracting, storing, and managing URL parameters from both query strings and hash-based routing. Includes sessionStorage persistence and parameter cleanup functions.",
  "frontend/tailwind.config.js": "Tailwind CSS configuration defining custom color scheme using OKLCH color space, container settings, extended theme with animations, and plugins for typography, container queries, and animations.",
  "project_state.json": "Project metadata tracking Phil3 platform state with known issue requiring consensus detection fix from 100% to majority agreement, and pending feature request for bilingual homepage implementation."
}