{
  "kind": "build_request",
  "title": "Add hero visual element to LoginPage homepage",
  "projectName": "Phil3",
  "priority": "normal",
  "requirements": [
    {
      "id": "REQ-3",
      "text": "Add a hero visual element at the top of the LoginPage component (frontend/src/pages/LoginPage.tsx) before the existing mission text section. The visual should be an abstract community-focused illustration that represents Phil3's philanthropic mission and adds visual interest to the landing page.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-latest"
        ],
        "quotes": [
          "I'll add a hero visual element to the top of the homepage. I'll create an abstract community-focused illustration that represents the philanthropic mission of Phil3."
        ]
      },
      "acceptanceCriteria": [
        "Hero visual element is positioned at the top of the LoginPage before the mission text section",
        "Visual uses an abstract community-focused design that aligns with Phil3's philanthropic mission",
        "Image is properly integrated into the existing layout without breaking the current styling",
        "Visual loads as a static asset from frontend/public/assets/generated"
      ]
    }
  ],
  "constraints": [
    "Do not modify the existing mission text content or structure that was recently updated",
    "Maintain the existing styling and layout of the LoginPage component",
    "Do not change authentication flow or functionality"
  ],
  "nonGoals": [
    "Modifying the mission text section content",
    "Changing the color scheme beyond the hero visual",
    "Adding interactive elements to the hero visual",
    "Implementing other homepage improvements mentioned in the earlier conversation"
  ],
  "imageRequirements": {
    "required": [
      "Abstract community-focused hero illustration representing philanthropy and decentralized community collaboration, featuring connected nodes or figures in a modern minimalist style with warm, welcoming tones (hero-community.dim_1200x400.png)"
    ],
    "edits": []
  }
}